{
  "case_title": "Animal Welfare Board of India & Ors. vs Union of India & Anr.",
  "key_facts": [
    "The Supreme Court of India had previously outlawed Jallikattu and Bullock Cart Race in 2014, deeming them contrary to the Prevention of Cruelty to Animals Act, 1960.",
    "In 2016, a notification was issued by the Ministry of Environment, Forest and Climate Change allowing bulls to be trained as performing animals in certain states under specific conditions.",
    "Several writ petitions were filed challenging the legality of the 2017 State Amendment Acts that sought to legitimize various types of bovine sports.",
    "The Karnataka Amendment Act defines 'Kambala' as a traditional sports event involving buffalo races, while the Maharashtra Amendment Act defines 'Bullock Cart Race' as a traditional sports event involving bulls.",
    "A PIL was filed in the High Court of Judicature at Bombay challenging proposed rules for the conduct of Bullock Cart Races in Maharashtra, which was restrained by the court."
  ],
  "legal_issues": [
    "Whether the Tamil Nadu Amendment Act is referable to Entry 17, List III of the Seventh Schedule of the Constitution of India or perpetuates cruelty to animals.",
    "Whether the impugned Tamil Nadu Amendment Act can be stated to be part of the cultural heritage of the people of Tamil Nadu so as to receive protection under Article 29 of the Constitution of India.",
    "Whether the Tamil Nadu Amendment Act ensures the survival and well-being of the native breed of bulls and is relatable to Article 48 of the Constitution of India.",
    "Whether the Tamil Nadu Amendment Act goes contrary to Articles 51A(g) and 51A(h) and is unreasonable and violative of Articles 14 and 21 of the Constitution of India.",
    "Whether the impugned Tamil Nadu Amendment Act directly contradicts the judgment in A. Nagaraja and the review judgment dated 16th November, 2016."
  ],
  "decision": "The case is pending and the Supreme Court is yet to deliver a final decision on the issues raised.",
  "reasoning_summary": "The Supreme Court is considering the constitutionality of the 2017 State Amendment Acts that seek to legitimize various types of bovine sports. The court is examining whether these amendments are in line with the Prevention of Cruelty to Animals Act, 1960, and whether they are colorable legislation or part of cultural heritage. The court is also assessing whether these amendments are unreasonable and violative of fundamental rights under Articles 14 and 21 of the Constitution of India."
}
